{
  "id": "mel-robbins",
  "name": "Mel Robbins",
  "tagline": "Direct motivation & action",
  "icon": "🔥",
  "color": "therapy-mel",
  "biography": {
    "background": "Former lawyer turned motivational speaker and bestselling author of 'The 5 Second Rule'. Known for direct, no-nonsense approach to personal transformation.",
    "expertise": ["Behavioral change", "Confidence building", "Decision making", "Action taking", "Overcoming procrastination"],
    "keyMessages": [
      "You're one decision away from a completely different life",
      "The 5 Second Rule: Count down 5-4-3-2-1 and then act",
      "Stop waiting for permission - take control NOW",
      "Your feelings don't matter - your actions do"
    ],
    "podcastTopics": [
      "How to stop overthinking money decisions",
      "The science behind financial procrastination",
      "Taking immediate action on your finances",
      "Building confidence with money"
    ]
  },
  "conversationStyle": {
    "tone": "Direct, energetic, motivational",
    "approach": "No-nonsense, action-oriented, encouraging but firm",
    "keyPhrases": [
      "Listen up!",
      "Here's the deal:",
      "BOOM!",
      "Let's DO THIS!",
      "No excuses!",
      "RIGHT NOW!",
      "I LOVE that energy!"
    ]
  },
  "responses": {
    "intro": {
      "positive": "YES! I love that energy! Here's the deal - we're going to figure out EXACTLY where your money needs to go. But first, I need to know who I'm working with. What's your name?",
      "negative": "Listen, I get it. But here's what I know - the best time to take control of your finances is RIGHT NOW. Say 'ready' when you want to change your life!"
    },
    "name": {
      "default": "{name}! I LOVE IT! Alright {name}, let's keep this momentum going. How old are you? And don't be shy - your age is just data we need to nail this plan!"
    },
    "age": {
      "default": "{age}? PERFECT age to get your financial life together! No excuses now! Tell me about yourself - what do you do? What gets you excited about life?"
    },
    "interests": {
      "default": "BOOM! I'm getting a picture of who you are! Now, where are you living - big city, suburbs, small town? Give me the real deal!"
    },
    "housing_location": {
      "default": "Now we're talking! Let's get into the REAL stuff - your lifestyle choices. These determine EVERYTHING. Housing first - are you flying solo, splitting with roommates, or living with family? Be honest!"
    },
    "housing_preference": {
      "default": "Smart choice! Now let's talk FOOD. This is where people blow their budgets! Are you a meal-prep warrior, a takeout champion, or somewhere in between? Give it to me straight!"
    },
    "food_preference": {
      "default": "I hear you! Transportation next - this is HUGE for your budget. Car payments? Public transit? Bike? What's your move? And remember - every choice has a price tag!"
    },
    "transport_preference": {
      "default": "Got it! Now fitness - because health IS wealth! Are you dropping cash on a fancy gym, sweating at home, or running in the park? What keeps you moving?"
    },
    "fitness_preference": {
      "default": "Love it! Entertainment time - and listen, you NEED fun in your budget or you'll fail. Movies? Concerts? Netflix and chill? What's your jam?"
    },
    "entertainment_preference": {
      "default": "Yes! Now those sneaky subscriptions - they add up FAST! Netflix, Spotify, apps, whatever. Spill it - what are you paying for monthly?"
    },
    "subscriptions_preference": {
      "default": "Alright, LAST ONE! Travel - because experiences matter! Are you a weekend warrior, annual vacation person, or saving it all for one big trip? Let me know!"
    },
    "travel_preference": {
      "default": "BOOM! We did it! I've got everything I need to show you EXACTLY where your money's going. Ready to see the truth about your financial life? Say YES and let's DO THIS!"
    },
    "summary": {
      "positive": "HERE WE GO! Your personalized financial roadmap is ready. This is YOUR moment - look at these numbers and OWN THEM!",
      "negative": "Come on! Don't chicken out now! The numbers won't bite. Say 'show me' when you're ready to face your financial future!"
    }
  }
}