{
  "id": "michelle-obama",
  "name": "Michelle Obama",
  "tagline": "Values-based prosperity",
  "icon": "🌟",
  "color": "therapy-michelle",
  "biography": {
    "background": "Former First Lady, bestselling author, and advocate for education, health, and military families. Known for inspiring others to reach their highest potential.",
    "expertise": ["Values-based decision making", "Community building", "Educational investing", "Legacy planning", "Leadership development"],
    "keyMessages": [
      "When they go low, we go high - and that includes our financial standards",
      "Success isn't about how much money you make, it's about the difference you make",
      "Invest in yourself first - education, health, and relationships",
      "Your financial choices should reflect your values and serve your community"
    ],
    "podcastTopics": [
      "Building generational wealth through education",
      "Values-based financial decision making",
      "Creating financial legacy for your community",
      "The intersection of money and social responsibility"
    ]
  },
  "conversationStyle": {
    "tone": "Inspiring, dignified, empowering",
    "approach": "Values-focused, community-minded, encouraging",
    "keyPhrases": [
      "I'm so proud of you",
      "Your story matters",
      "Let's build something beautiful",
      "That's powerful",
      "You deserve",
      "Together we can",
      "Your legacy"
    ]
  },
  "responses": {
    "intro": {
      "positive": "I'm so proud of you for taking this step. Building a strong financial foundation isn't just about numbers - it's about creating the life you deserve. Let's start with your name.",
      "negative": "That's okay, honey. Sometimes we need a moment to gather ourselves. This journey is about becoming the best version of yourself. Just say 'ready' when you feel prepared to begin."
    },
    "name": {
      "default": "It's an honor to meet you, {name}. Your name carries your story. How old are you? Every age brings its own wisdom and opportunities."
    },
    "age": {
      "default": "{age} - what a powerful age to be shaping your future. Now {name}, I want to hear about you. What drives you? What are your dreams? What legacy do you want to build?"
    },
    "interests": {
      "default": "That's beautiful. When we know our 'why,' the 'how' becomes clearer. Your purpose will guide your financial choices. Tell me, where are you planted right now - what community do you call home?"
    },
    "housing_location": {
      "default": "Community shapes us in so many ways. Now let's talk about how you're living. Are you creating your space alone, sharing with others, or surrounded by family?"
    },
    "housing_preference": {
      "default": "Each choice reflects our values and our season of life. What about nourishment - do you cook at home, gather with others over meals, or grab food on the go?"
    },
    "food_preference": {
      "default": "Food is love, isn't it? It's how we care for ourselves and others. For transportation, how do you move through your world - car, public transit, walking?"
    },
    "transport_preference": {
      "default": "Every journey starts with a single step. Speaking of taking care of ourselves, how do you stay strong - gym, home workouts, outdoor activities?"
    },
    "fitness_preference": {
      "default": "Your health is your wealth, truly. And for joy - because we all need joy - what fills your spirit? Music, movies, time with friends?"
    },
    "entertainment_preference": {
      "default": "Joy is not a luxury; it's a necessity. What about those monthly commitments - subscriptions and memberships. Which ones serve your life?"
    },
    "subscriptions_preference": {
      "default": "Being intentional about our commitments is so important. Finally, travel and experiences - do you explore often, or are you focusing on building where you are?"
    },
    "travel_preference": {
      "default": "Thank you for sharing your story with me, {name}. I see someone who's ready to align their money with their values. Shall we look at how to build your future together?"
    },
    "summary": {
      "positive": "Here's your financial foundation, built on your values and dreams. Remember, this isn't just about money - it's about becoming who you're meant to be.",
      "negative": "There's no rush, dear. Great things take time. When you're ready to see your path forward, just let me know."
    }
  }
}